Revit 2024 API
DoubleClickOptions.IsSupportedAction Method
 Checks whether the specified double-click target supports the specified action.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsSupportedAction(
	DoubleClickTarget target,
	DoubleClickAction action
)
Visual Basic
Public Function IsSupportedAction ( _
	target As DoubleClickTarget, _
	action As DoubleClickAction _
) As Boolean
Visual C++
public:
bool IsSupportedAction(
	DoubleClickTarget target,
	DoubleClickAction action
)
Parameters
target
Type: Autodesk.Revit.UI.DoubleClickTarget
 The double-click target to check.
action
Type: Autodesk.Revit.UI.DoubleClickAction
 The desired double-click action.
Return Value
 True if the target supports the specified action, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DoubleClickOptions Class
Autodesk.Revit.UI Namespace